Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་ལོ་སྟོང་དུ་དམ་པའི་ཆོས་གནས་པར་གྱུར་ཅིག །
en: When I have passed into parinirvāṇa, may my good Dharma remain for one thousand years.

source: ཡང་ལོ་ལྔ་བརྒྱར་ནི་དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་གནས་པར་གྱུར་ཅིག །
en: May the outer appearance of the good Dharma remain for another five hundred years. “ ‘

source: སེམས་ཅན་གང་དག་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་རྣམས་ལས་རིན་པོ་ཆེ་རྣམས་དང་། རོལ་མོའི་སྒྲ་དག་གི་བར་གྱིས་མཆོད་པ་བགྱིད་པར་སྤྲོ་བ་སྐྱེ་བར་འགྱུར་བ་དང་། ཐ་ན་སངས་རྒྱས་ཀྱི་མཚན་གཅིག་ཙམ་དང་། ཕྱག་གཅིག་ཙམ་དང་། བསྐོར་བ་གཅིག་ཙམ་དང་། ཐལ་མོ་སྦྱོར་བ་གཅིག་ཙམ་དང་།
en: After I have passed into parinirvāṇa, if beings delight in making offerings to my relics, either with jewels or music, even if they say just once the name of the buddhas, or do one prostration or one circumambulation, or place their hands together in homage once, or make an offering of just one flower, may they all attain irreversibility through the three yānas according to their dispositions. “ ‘

source: མེ་ཏོག་གཅིག་ཙམ་གྱི་རྒྱུས་མཆོད་པ་བགྱིད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐེག་པ་གསུམ་པོ་དག་གིས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །སེམས་ཅན་གང་དག་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བསྟན་པ་ལ་ཐ་ན་བསླབ་པའི་གཞི་གཅིག་ཙམ་འཛིན་པར་འགྱུར་རམ། ཅི་སྐད་བསྟན་པ་བཞིན་དུ་ཡང་དག་པར་བླངས་ནས་གནས་སམ། ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཙམ་གྱི་བར་དག་ཀུན་ཆུབ་པར་བགྱིད་དམ། ཀློག་གམ། གཞན་དག་ལ་ཡང་སྟོན་པར་འགྱུར་བ་དང་། གང་དག་གིས་ཐོས་ནས་སེམས་རབ་ཏུ་དང་བར་འགྱུར་ཞིང་།
en: After I have passed into parinirvāṇa, those beings who adopt even one basis of training in my teachings and who undertake and abide by it just as I have taught it, and so on—even down to those who comprehend just one four-line verse, recite it, and teach it to others, or even those who listen to it and have faith in it, or make an offering to the Dharma reciter of just one flower or one prostration—may they all attain irreversibility through the three yānas according to their dispositions. “ ‘

source: ཐ་ན་དམ་པའི་ཆོས་སྨྲ་བ་ལ་མེ་ཏོག་གཅིག་ཙམ་དང་། ཕྱག་གཅིག་ཙམ་གྱིས་མཆོད་པ་བགྱིད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐེག་པ་གསུམ་པོ་དག་གིས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །ཇི་ཙམ་ན་དམ་པའི་ཆོས་ནུབ་སྟེ། ཆོས་ཀྱི་སྒྲོན་མ་ནི་གུམ། ཆོས་ཀྱི་རྒྱལ་མཚན་ནི་འགྱེལ་བར་གྱུར་པ་ན་བདག་སྐྱེས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་གསེར་གྱི་འཁོར་ལོའི་མཐར་ཐུག་པའི་དོགས་ལ་ལྷགས་པར་འགྱུར་ཞིང་།
en: When the Dharma has ceased to exist, when the torch of the Dharma has gone out, when the victory banner of the Dharma has fallen, may my relics sink down as far as the golden disk and remain there.

source: གང་གི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་རིན་པོ་ཆེས་ཕོངས་པར་གྱུར་པ་དེའི་ཚེ་ན། དེ་དག་ནོར་བུ་བཻ་དཱུརྱ་ཏོག་གི་བློ་གྲོས་ཞེས་བགྱི་བར་གྱུར་ཏེ་ཞུགས་ལྟར་གདའ་ཞིང་ཀུན་ཏུ་གནས་པར་གྱུར་ཅིག །དེ་ཡང་དེ་ནས་མངོན་པར་འཕགས་ཏེ།
en: When jewels have become scarce in the Sahā buddha realm, may my relics become beryl jewels called ketumati that are as bright as fire.

source: གོང་དུ་འོག་མིན་གྱི་གནས་ཀྱི་མཐར་ཐུག་པའི་བར་དུ་གནས་ནས་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པར་འགྱུར་ཞིང་། མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། པ་རི་ཡ་ཏྲ་ཀ་དང་། མན་ཛུ་ཤ་ཀ་དང་། མན་ཛུ་ཤ་ཀ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། མ་ན་པརྞ་དང་། ཟླ་བ་དྲི་མེད་དང་། འདབ་བརྒྱ་པ་དང་། འདབ་སྟོང་པ་དང་། ཀུན་ཏུ་འོད་དང་། ཀུན་ཏུ་དྲི་དང་། ཤིན་ཏུ་མཛེས་པ་དང་། རྟག་ཏུ་འབྲས་བུ་རྒྱས་དང་། སྙིང་དང་མིག་མངོན་པར་དགའ་བ་དང་།
en: May they rise upward until they reach the Akaniṣṭha paradise, and from there may they fall as a rain of various flowers—coral tree flowers, great coral tree flowers, night-flowering jasmine, mañjuśaka, mahāmañjuśaka, roca, mahāroca, mānapūrṇā, and candravimalā—with a hundred petals, with a thousand petals, with a hundred thousand petals, completely bright, completely aromatic, very beautiful, always with seed, bringing joy to the eyes and heart, as bright as stars, the color of stars, with infinite scent, and with infinite radiance.

source: སྐར་འོད་དང་། སྐར་མདོག་དང་། ཁ་དོག་མཐའ་ཡས་དང་། དྲི་མཐའ་ཡས་དང་། མེ་ཏོག་དེ་ལྟ་བུ་དག་གི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མངོན་པར་རབ་ཏུ་འབེབས་པར་གྱུར་ཅིག །མེ་ཏོག་གི་ཆར་དེ་དག་ལས་ཀྱང་སྒྲ་སྣ་ཚོགས་དག་འབྱུང་བར་འགྱུར་ཞིང་། འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་སྒྲ་དང་།
en: May there be a great rain of such flowers. “ ‘

source: ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། དགེ་བསྙེན་གྱི་སྡོམ་པའི་སྒྲ་དང་། འཕགས་པའི་གསོ་སྦྱོང་གི་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་སྒྲ་དང་། རབ་ཏུ་བྱུང་བའི་བསླབ་པའི་གཞི་བཅུའི་སྡོམ་པ་སྦྱིན་པའི་སྒྲ་དང་། ཚུལ་ཁྲིམས་ཀྱི་སྒྲ་དང་།
en: May that rain of flowers emit the sound of various words, such as the word Buddha, the word Dharma, the word Saṅgha, the words the upāsaka vows, the words the observance of the noble eightfold upoṣadha, the words the ten vows that are the training foundations of monastic ordination, the word generosity, the words good conduct, the words the complete brahmacarya, the words complete monastic ordination with full celibacy, the word instruction, the word reading, the word memorizing, the word withdrawal, the words complete attention, the word unpleasant, the words mindfulness of breathing, the words the state of neither perception nor nonperception, the words the state of nothingness, the words the state of infinite consciousness, the words the state of infinite space, the words the state of subjugation, the words the state of totality, the words śamatha and vipaśyanā, the word emptiness, the word fixedless, the word signless, the words dependent origination, and the words the entire piṭaka of the śrāvakas.

source: ཚངས་པར་སྤྱོད་པ་མཐའ་དག་ཡོངས་སུ་རྫོགས་པ་བསྙེན་པར་རྫོགས་པའི་སྒྲ་དང་། ཞལ་ཏ་བགྱིད་པའི་སྒྲ་དང་། ཀློག་པའི་སྒྲ་དང་། ནང་དུ་ཡང་དག་འཇོག་གི་སྒྲ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བགྱིད་པའི་སྒྲ་དང་། མི་སྡུག་པའི་སྒྲ་དང་། དབུགས་རྒྱུ་བ་དང་། རྔུབ་པའི་སྒྲ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྒྲ་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྒྲ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྒྲ་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྒྲ་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་ཀྱི་སྒྲ་དང་། ཟད་པར་གྱི་སྐྱེ་མཆེད་ཀྱི་སྒྲ་དང་། ཞི་གནས་དང་ལྷག་མཐོང་གི་སྒྲ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མ་མཆིས་པའི་སྒྲ་དང་། སྨོན་པ་མ་མཆིས་པའི་སྒྲ་དང་།
en: May it emit the words the entire piṭaka of the pratyekabuddhas.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྒྲ་དང་། ཉན་ཐོས་ཀྱི་སྡེ་སྣོད་མཐའ་དག་གི་སྒྲ་འབྱུང་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་སྡེ་སྣོད་མཐའ་དག་གི་སྒྲ་འབྱུང་བ་དང་། ཐེག་པ་ཆེན་པོའི་གཏམ་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཐའ་དག་གི་སྒྲ་དག་མེ་ཏོག་དེ་དག་ལས་འབྱུང་བར་འགྱུར་ཞིང་།
en: May those flowers disseminate the words of the entire teaching of the Mahāyāna and the six perfections. “ ‘

source: གཟུགས་ན་སྤྱོད་པའི་ལྷ་ཐམས་ཅད་ཀྱིས་ཐོས་པར་གྱུར་ནས།
en: May all the devas in the form realm hear those words.

source: རང་རང་གིས་སྔོན་ཆད་བགྱིས་པའི་དགེ་བའི་རྩ་བ་དག་ཀྱང་རྗེས་སུ་དྲན་པར་འགྱུར་ཞིང་།
en: May they each remember the good roots they have created in their past lives.

source: སེམས་ཅན་ཆེན་པོ་དག་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་སྨོན་པ་མ་མཆིས་པར་གྱུར་ནས། དེ་དག་དེ་ནས་བབས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་མི་ཐམས་ཅད་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་སྦྱོར་ཞིང་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May those great beings not turn away from all the good qualities, but descend from that paradise and enjoin all the humans in the Sahā world realm to the path of the ten good actions and establish them therein. “ ‘

source: དེ་བཞིན་དུ་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཐོས་པར་འགྱུར་ཞིང་།
en: In the same way, may the devas who are inhabitants of the desire realm hear those words.

source: དེ་དག་ཀྱང་སྲེད་པའི་ཀུན་ཏུ་སྦྱོར་བ་དང་། དགའ་བ་དང་། རྩེད་མོ་དང་། ཡིད་བདེ་བ་ལ་མངོན་པར་དགའ་བའི་སེམས་དང་སེམས་ལས་བྱུང་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་གྱུར་ཅིག །
en: May they end all their mental activities of craving, indulgence in pleasures, and enjoyment of delights.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་རང་རང་གིས་སྔོན་ཆད་བགྱིས་པའི་དགེ་བའི་རྩ་བ་དག་རྗེས་སུ་དྲན་པར་འགྱུར་ཞིང་།
en: May they all remember the good roots they have planted in their past lives.

source: དེ་དག་ལྷའི་འཇིག་རྟེན་ནས་བབས་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་མི་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །བཙུན་པ་བཅོམ་ལྡན་འདས་མེ་ཏོག་དེ་དག་ཀྱང་ནམ་མཁའ་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་དག་ཏུ་འགྱུར་ཞིང་། འདི་ལྟ་སྟེ། དངུལ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་།
en: May they descend from the deva realms and encourage all the humans in the Sahā world realm to the ten good courses of action and establish them therein. “ ‘

source: རྡུལ་ཅན་དང་། ས་ལེ་སྦྲམ་དང་། རྡོའི་སྙིང་པོ་དང་། གཡས་སུ་འཁྱིལ་པ་དང་། དེ་ལྟ་བུའི་རིན་པོ་ཆེའི་ཆར་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་མངོན་པར་རབ་ཏུ་འབབ་པར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, may those flowers in the air transform into various precious materials: a precious rain of silver, cowries, gold, gems, pearls, beryl, conch, crystal, coral, golden objects and silver objects, emeralds, and rightward-spiraling conch shells that fall over the entire Sahā buddha realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་ན་ཐབ་མོ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། ཚིག་རྩུབ་ཅིང་བརླང་བ་དང་།
en: May conflict, fighting, dispute, famine, disease, enemy armies, harsh speech, unkindness, and poison completely cease to exist everywhere throughout the Sahā buddha realm.

source: དུག་རྣམས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་བདེ་བ་དང་། ནད་མ་མཆིས་པ་དང་། ཐབ་མོ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འཆིང་བ་དག་མ་མཆིས་པ་དང་།
en: May there be happiness, no disease, no conflict, no fighting, no dispute, no being held in bondage, and abundant food everywhere throughout the entire Sahā buddha realm.

source: ལོ་ལེགས་པ་དག་ཀུན་ཏུ་གནས་པར་གྱུར་ཅིག །སེམས་ཅན་གང་དག་གིས་རིན་པོ་ཆེ་དེ་དག་མཐོང་བ་དང་། རེག་པ་དང་། ལོངས་སྤྱོད་པ་དང་། ཡོངས་སུ་སྤྱོད་པའི་ལས་བགྱིད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་གིས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: And when those beings see those precious things, touch them, enjoy them, or use them, may they all attain irreversibility in the three yānas.

source: སྐུ་གདུང་དེ་དག་ཀྱང་སླར་གསེར་གྱི་འཁོར་ལོའི་མཐར་ཐུག་པའི་བར་དུ་གནས་པར་གྱུར་ཅིག། །།བམ་པོ་བཅུ་གཅིག་པ།
en: Then may my relics again descend to the golden disk and remain there. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་མཚོན་གྱི་བསྐལ་པ་བར་མའི་དུས་ཀྱི་ཚེ་ན་ཡང་དེ་དག་ནོར་བུ་རིན་པོ་ཆེ་ཨན་ད་རྙིལ་དག་ཏུ་ཀུན་ནས་གནས་པར་འགྱུར་ཞིང་། དེ་དག་སྟེང་དུ་འོག་མིན་གྱི་གནས་ཀྱི་མཐར་ཐུག་པའི་བར་དུ་གནས་ནས།
en: Bhadanta Bhagavat, in the same way, during the intermediate eon of weapons, may my relics become precious sapphire jewels, and may they ascend to the Akaniṣṭha paradise.

source: འདི་ལྟ་སྟེ། མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། པ་རི་ཡ་ཏྲ་ཀ་དང་། མེ་ཏོག་འོད་མཐའ་ཡས་ཀྱི་བར་གྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་དག་མངོན་པར་རབ་ཏུ་འབེབས་པར་གྱུར་ཅིག །
en: May they fall as a rain of various flowers: coral tree flowers, great coral tree flowers, night-flowering jasmine, and so on, as previously described, up to and including all with infinite radiance.

source: མེ་ཏོག་གི་ཆར་དེ་དག་ལས་ཀྱང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། སྒྲ་ཡིད་དུ་འོང་བ་རྣམ་པ་སྣ་ཚོགས་དག་འབྱུང་བར་གྱུར་ཅིག །
en: May that rain of flowers emit pleasant words: the word Buddha, the word Dharma, the word Saṅgha, and so on, as previously described.

source: ཡང་སྐུ་གདུང་དེ་དག་ཀྱང་སླར་འོག་ཏུ་གསེར་གྱི་འཁོར་ལོའི་མཐར་ཐུག་པའི་བར་དུ་ཀུན་ཏུ་གནས་པར་གྱུར་ཅིག །
en: Then may my relics again descend to the golden disk and remain there. “ ‘

source: དེ་བཞིན་དུ་གང་གི་ཚེ་མུ་གེའི་བསྐལ་པ་བར་མའི་དུས་ཀྱི་ཚེ་ན་ཡང་སྐུ་གདུང་དེ་དག་སྟེང་དུ་འོག་མིན་གྱི་གནས་ཀྱི་མཐར་ཐུག་པའི་བར་དུ་གྱེན་དུ་འཕགས་ནས་མེ་ཏོག་གི་ཆར་གྱི་བར་དུ་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །
en: In the same way, during the intermediate eon of famine, may those relics ascend to the Akaniṣṭha paradise and then fall as a rain of flowers, and so on, as previously described. “ ‘

source: ནད་ཀྱི་བསྐལ་པ་བར་མའི་བར་དུ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་གྱུར་ཅིག །
en: In the same way, may what has been described occur during the intermediate eon of illness.

source: ཇི་ལྟར་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་ལ་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་རྣམས་སྟོན་པའི་མཛད་པ་བགྱིད་པར་འགྱུར་ཞིང་། འདུལ་བ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་གིས་སླར་མི་ལྡོག་པ་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I manifest these relics after my passing into parinirvāṇa in the great Bhadraka eon so that innumerable disciples will be established in irreversibility through the three yānas. “ ‘

source: དེ་བཞིན་དུ་བསྐལ་པ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ལྔའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་བྱུང་གི་བར་དུ་ཡང་། བདག་གི་སྐུ་གདུང་རྣམས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་པོ་དག་གིས་སླར་མི་ལྡོག་པ་ལ་འགོད་པར་གྱུར་ཅིག །
en: In the same way, until as many great eons as there are particles in five buddha realms have passed, may my relics establish beings in irreversibility through the three yānas. “ ‘

source: བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པ་ན་གང་དག་བདག་གིས་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཅིང་རབ་ཏུ་བཀོད་པ་རྣམས་དང་། བདག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པ་དེ་དག་སླད་ཀྱིས་གང་གི་ཚེ་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་སྟོང་གི་བྱེ་མ་སྙེད་འདས་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དང་གཞན་དག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤ་སྟག་ཏུ་གྱུར་ཏེ་འབྱུང་བར་གྱུར་ཅིག །
en: May those beings whom I first encourage, guide, and establish in the aspiration for the highest, most complete enlightenment, when I am a bodhisattva performing the bodhisattva conduct for attaining the highest, most complete enlightenment, and whom I encourage, guide, and establish in the practice of the six perfections, become, after as many eons as there are grains of sand in a thousand Ganges Rivers have passed, bhagavat buddhas in this and that world—in numberless, countless worlds in the ten directions. “ ‘

source: བདག་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པའི་སེམས་ཅན་རྣམས་དང་། གང་དག་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་གི་རྣམ་པར་འཕྲུལ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་སླད་ཀྱིས་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་སྟོང་གི་བྱེ་མ་སྙེད་བྱུང་ཞིང་འདས་པར་གྱུར་པ་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འདི་སྐད་དུ་གང་ཡུན་རིང་པོ་ན་བསྐལ་པ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་ཏེ། བསྐལ་པ་བཟང་པོ་དེ་ལ་བབ་པ་ན།
en: Also, after I have attained enlightenment, may I encourage, guide, and establish beings in the aspiration for the highest, most complete enlightenment, and upon passing into parinirvāṇa, through the manifestation of my relics may those who develop the aspiration for the highest, most complete enlightenment become bodhisattva mahāsattvas, and after as many eons as there are grains of sand in a thousand Ganges Rivers have passed, attain the complete enlightenment of perfect buddhahood in numberless, countless worlds in the ten directions.

source: རྒྱལ་བ་ཉི་མ་བཞི་པ་དེ་བཞིན་གཤེགས་པ་མཚན་འདི་ཞེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་པ་དེས་བདག་ཅག་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: May they then praise me and declare and proclaim, “A long time ago, when there was the Bhadraka eon, there was the fourth sun-like jina, the tathāgata, whose name was…” and so on. “He was the one who first encouraged, guided, and established us in the aspiration for the highest, most complete enlightenment.

source: །བདག་ཅག་ནི་སེམས་ཀྱི་རྒྱུད་ཚིག་པ། མི་དགེ་བ་དང་འགྲོགས་པར་གྱུར་པ་མཚམས་མེད་པ་བྱེད་པ། ལོག་པར་ལྟ་བའི་བར་དུ་གྱུར་པ་ཡིན་ན།
en: We had minds that were burning, we were engaged in planting bad roots, we had committed actions with immediate result at death, and we had wrong views.

source: དེས་བདག་ཅག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པས་ན་དེའི་ཕྱིར་བདག་ཅག་ད་ལྟར་ཐམས་ཅད་མཁྱེན་པར་གྱུར་ཅིང་། རྣམ་པ་ཐམས་ཅད་དུ་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་ལ།
en: He encouraged, guided, and established us in the six perfections. Because of that we are now omniscient ones who turn the Dharma wheel that possesses all aspects of the Dharma.

source: འགྲོ་བའི་འཁོར་ལོ་ཟློག་ཅིང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་མཐོ་རིས་དང་ཐར་པའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་ཡིན་ནོ།
en: We reverse the wheel of becoming and bring many hundreds of thousands of millions of trillions of beings to the result of the higher existences and liberation.” “ ‘

source: །ཞེས་བདག་གི་བསྔགས་པ་རྗོད་ཅིང་སྒྲོགས་ལ་དབྱངས་ཀྱང་རྗོད་པར་གྱུར་ཅིག །གང་དག་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་བདག་གི་བསྔགས་པ་དང་། གྲགས་པ་དང་། སྙན་པ་ཐོས་པར་གྱུར་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེས་དོན་གྱི་དབང་ཅི་ཞིག་གཟིགས་ན་དེ་ལྟར་རྩོད་པའི་དུས་ལ་བབ་ཅིང་སྙིགས་མ་ལྔ་བྱུང་བར་གྱུར་པ་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་ཞུ་བར་གྱུར་ཅིག །
en: When those who are seeking enlightenment hear from those tathāgatas those praises of me and of my fame and renown, may they ask those tathāgatas, “With what purpose in mind did that bhagavat, that tathāgata, pray, ‘May I attain the complete enlightenment of perfect buddhahood during a kaliyuga at the time of the five degeneracies’?” “ ‘

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་བདག་གི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་སེམས་དང་པོ་བསྐྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚུལ་འདི་ཡང་སྟོན་པར་གྱུར་ཅིག །
en: May those tathāgatas then describe to those noble sons or noble daughters who are seeking enlightenment how I first developed my aspiration with great compassion, and describe the qualities of my buddha realm and my prayer. “ ‘

source: བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ཀྱང་ངོ་མཚར་དུ་འཛིན་པར་འགྱུར་ཞིང་།
en: Then may the noble sons or noble daughters who seek enlightenment be astonished.

source: དེ་དག་ཀྱང་རྒྱ་ཆེན་པོ་ལ་མོས་པར་གྱུར་ཅིག །
en: Then may they too develop a vast aspiration.

source: དེ་དག་ཀྱང་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པར་འགྱུར་ཞིང་།
en: May they have a similar great compassion for beings.

source: དེ་ལྟར་རྩོད་པའི་དུས་སུ་སྙིགས་མ་ལྔ་དང་། ཉོན་མོངས་པའི་སྙིགས་མ་བདོ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། མི་དགེ་བའི་བར་དག་དང་འགྲོགས་པའི་འདུལ་བ་རབ་ཏུ་འཛིན་པར་གྱུར་པ་དེ་ལྟ་བུའི་སྨོན་ལམ་ཡང་འདེབས་པར་གྱུར་ཅིག །
en: May they pray that during a kaliyuga in a buddha realm when the kleśas are powerful and the five degeneracies are powerful that they will have as disciples those who have committed actions with immediate result at death, and so on, up to and including those who have committed bad actions. “ ‘

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་སྙིགས་མ་ལྔ་དང་། ཉོན་མོངས་པ་བདོ་བའི་རྩོད་པའི་དུས་སུ་སྨོན་ལམ་བཏབ་པ་བཞིན་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་དག་གི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་ལྟ་བུའི་ལུང་བསྟན་པས་ལུང་སྟོན་པར་གྱུར་ཅིག །
en: May those buddhas, those bhagavats, also prophesy to those noble sons or noble daughters who seek enlightenment and have prayed to be in a kaliyuga when the five degeneracies and the kleśas are powerful, that for those noble sons or noble daughters who seek enlightenment and have great compassion it will be exactly as they have wished. “ ‘

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་དག་ཀྱང་སེམས་ཅན་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་འདི་སྐད་དུ་ཡུན་རིང་པོ་འདི་སྲིད་ཅིག་ན་རྒྱལ་བ་ཉི་མ་མཚན་འདི་ཞེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་རྣམས་ཀྱིས་དེ་ལྟར་སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དེ་ལྟ་བུའི་ཆོ་འཕྲུལ་རྣམ་པ་སྣ་ཚོགས་དག་དང་། རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་མཛད་དེ།
en: May other bhagavat buddhas also say to noble sons or noble daughters who seek enlightenment, “A long time ago, there was a sun-like jina whose name was…” and so on. “After he passed into parinirvāṇa, his relics manifested various kind of miracles and manifold transformations for the sake of beings in suffering.

source: དེའི་སྐུ་གདུང་གི་རྣམ་པར་འཕྲུལ་པ་དག་གིས་ངེད་ཅག་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྐུལ་ནས། ངེད་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱིར་དགེ་བའི་རྩ་བ་དང་འགྲོགས་པས་དང་པོ་སེམས་བསྐྱེད་ཅིང་།
en: It was the transformation of those relics that first inspired us toward the highest, most complete enlightenment and to first develop the aspiration for enlightenment, to plant good roots in order to attain the highest, most complete enlightenment, and to dedicate ourselves to these perfections.”

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དག་ལ་བརྩོན་པར་བྱས་སོ་ཞེས་བདག་གི་སྐུ་གདུང་གི་རྣམ་པར་འགྱུར་བའི་སྔོན་གྱི་ཚུལ་དག་རྒྱ་ཆེར་ཇི་ལྟར་སྔར་སྨོས་པའི་བར་དུ་རྒྱ་ཆེར་སྟོན་པར་གྱུར་ཅིག །
en: May they in that way teach in detail what occurred with my relics as was previously described.’ “

source: དེ་ནས་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་ལྷ་དང་། དྲི་ཟ་དང་། མི་དང་བཅས་པའི་སྐྱེ་དགུ་ཐམས་ཅད་ཀྱི་དོན་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་སྨོན་ལམ་ཆེན་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་བཏབ་ནས་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བདག་གིས་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་ལ་ཉོན་མོངས་པ་དང་། ཐབ་མོ་དང་།
en: Then the brahmin Samudrareṇu, the principal royal priest, in the presence of the Tathāgata Ratnagarbha and for the sake of all beings, including devas, gandharvas, and humans, made those five hundred prayers with great compassion.

source: སྙིགས་མ་བདོ་ཞིང་རྩོད་པའི་དུས་ལ་བབ་པ་ན་འཇིག་རྟེན་ལྡོངས་ཤིང་འདྲེན་པ་མ་མཆིས་པ་དང་། ཡོངས་སུ་འདྲེན་པ་མ་མཆིས་པ་དང་། ལྟ་བའི་སྡུག་བསྔལ་གྱི་མུན་པར་ཆུད་པའི་འཇིག་རྟེན་ན་མཚམས་མ་མཆིས་པ་བགྱིད་པ་རྣམས་དང་། སྔར་སྨོས་པ་ལྟ་བུའི་བར་དག་ལ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་། གལ་ཏེ་བདག་གིས་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་མཛད་པ་ཐམས་ཅད་སྒྲུབ་པར་རྔོ་ཐོགས་པ་ལྟ་ན་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྨོན་པ་སྤང་བར་མི་བགྱི་ཞིང་། དགེ་བའི་རྩ་བ་ཡང་ཞིང་གཞན་དུ་ཡོངས་སུ་བསྔོ་བར་མི་བགྱི་སྟེ།
en: Then he said, ‘Bhadanta Bhagavat, if my aspirations are to be completely fulfilled, such that I will be there in a future time in the Bhadraka eon, during the kaliyuga when there are powerful kleśas, strife, and degeneracies, and beings are in the darkness of the suffering from wrong views, are without guides, are without a leader, have committed the actions with immediate results at death, and so on, as previously described—if I am able to accomplish the entirety of such activity of a buddha as I have prayed for, then I will not abandon my prayer for enlightenment and I will not dedicate my good roots for another realm.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ནི་བདག་གི་ངེས་པ་ལགས་སོ།
en: Bhadanta Bhagavat, such is my resolve. “ ‘

source: །ཡང་བདག་ནི་དགེ་བའི་རྩ་བ་དེས་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་མི་འཚལ།
en: And through these good roots, I do not pray for the Pratyekabuddhayāna.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ཡང་མི་འཚལ།
en: I do not pray for the Śrāvakayāna.

source: ལྷ་དང་མིའི་འཇིག་རྟེན་གྱི་རྒྱལ་སྲིད་ཀྱང་མི་འཚལ།
en: I do not pray to be a king among devas or humans.

source: ལྷ་དང་མིའི་འཇིག་རྟེན་གྱི་དབང་ཕྱུག་ཀྱང་མི་འཚལ།
en: I do not pray for lordship in the deva or human worlds.

source: འདོད་པ་ལྔའི་ཡོན་ཏན་གྱི་ལོངས་སྤྱོད་ཀྱང་མི་འཚལ།
en: I do not pray for the enjoyment of the five sensory pleasures.

source: ལྷར་སྐྱེ་བ་ཡང་མི་འཚལ། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: I do not pray to be reborn as a deva.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཀླུ་དང་།
en: I do not pray to be reborn as a gandharva, asura, yakṣa, rākṣasa, nāga, or garuḍa.

source: ནམ་མཁའ་ལྡིང་དུ་སྐྱེ་བ་ཡང་མི་འཚལ་ལ་དགེ་བའི་རྩ་བ་གཞན་དུ་ཡོངས་སུ་བསྔོ་བར་ཡང་མི་བགྱིད་དེ།
en: I do not dedicate my good roots to this. “ ‘

source: གང་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་སྦྱིན་པས་ནི་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར།
en: Bhagavat, you have said, “Generosity leads to great wealth.

source: ཚུལ་ཁྲིམས་ཀྱིས་ནི་མཐོ་རིས་སུ་སྐྱེ།
en: Correct conduct leads to rebirth in higher existences.

source: ཐོས་པས་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར།
en: Listening to the Dharma leads to great wisdom.

source: བསྒོམ་པས་ནི་འབྲལ་བར་འགྱུར་རོ།
en: Meditation leads to liberation.”
